In [1]:
from pandas import DataFrame

In [2]:
# 簡単なDataFrameを作ります。

dframe = DataFrame({'city': ['Alma', 'Brian Head', 'Fox Park'],
                    'altitude': [3158, 3000, 2762]})
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [3]:
# マッピングを使うと、簡単に列を追加できます。

state_map={'Alma': 'Colorado', 'Brian Head': 'Utah', 'Fox Park': 'Wyoming'}

In [4]:
# mapメソッドを使います。

dframe['state'] = dframe['city'].map(state_map)

In [5]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming